###################################################################

# Created by write_sdc on Thu Nov 30 19:06:27 2017

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -power mW -voltage V       \
-current mA
set_driving_cell -lib_cell inv_1 [get_ports clk]
set_driving_cell -lib_cell inv_1 [get_ports reset]
set_driving_cell -lib_cell inv_1 [get_ports {in[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {in[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {w[0]}]
set_load -pin_load 57.462 [get_ports {out[15]}]
set_load -pin_load 57.462 [get_ports {out[14]}]
set_load -pin_load 57.462 [get_ports {out[13]}]
set_load -pin_load 57.462 [get_ports {out[12]}]
set_load -pin_load 57.462 [get_ports {out[11]}]
set_load -pin_load 57.462 [get_ports {out[10]}]
set_load -pin_load 57.462 [get_ports {out[9]}]
set_load -pin_load 57.462 [get_ports {out[8]}]
set_load -pin_load 57.462 [get_ports {out[7]}]
set_load -pin_load 57.462 [get_ports {out[6]}]
set_load -pin_load 57.462 [get_ports {out[5]}]
set_load -pin_load 57.462 [get_ports {out[4]}]
set_load -pin_load 57.462 [get_ports {out[3]}]
set_load -pin_load 57.462 [get_ports {out[2]}]
set_load -pin_load 57.462 [get_ports {out[1]}]
set_load -pin_load 57.462 [get_ports {out[0]}]
create_clock [get_ports clk]  -period 50000  -waveform {0 25000}
